#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.validate_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_validate_data_lambda_function]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.logs.aws_cloudwatch_log_group.register_lambda_function: Refreshing state... [id=/aws/lambda/demo_register_lambda_function]
module.logs.aws_cloudwatch_log_group.connect_lambda_function: Refreshing state... [id=/aws/lambda/demo_connect_lambda_function]
module.logs.aws_cloudwatch_log_group.change_user_role_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_user_role_lambda_function]
module.logs.aws_cloudwatch_log_group.message_lambda_function: Refreshing state... [id=/aws/lambda/demo_message_lambda_function]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s
module.logs.aws_cloudwatch_log_group.upload_file_s3_lambda_function: Refreshing state... [id=/aws/lambda/demo_upload_file_s3_lambda_function]
module.logs.aws_cloudwatch_log_group.download_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_download_comparison_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_public_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_public_companies_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/get_company_handler.zip]
module.buckets.aws_s3_bucket_object.disconnect_function_object: Refreshing state... [id=lambdas/demo/disconnect.zip]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.buckets.aws_s3_bucket_object.upload_file_s3_function_object: Refreshing state... [id=lambdas/demo/upload_file_s3_handler.zip]
module.buckets.aws_s3_bucket_object.register_function_object: Refreshing state... [id=lambdas/demo/register.zip]
module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_public_companies_handler.zip]
module.buckets.aws_s3_bucket_object.change_user_role_function_object: Refreshing state... [id=lambdas/demo/change_user_role_handler.zip]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.buckets.aws_s3_bucket_object.connect_function_object: Refreshing state... [id=lambdas/demo/connect.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.policy.aws_iam_role.change_user_role_lambda_exec_role: Refreshing state... [id=demo_change_user_role_lambda_exec_role]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.policy.aws_iam_role.disconnect_lambda_exec_role: Refreshing state... [id=demo_disconnect_lambda_exec_role]
module.policy.aws_iam_role.message_lambda_exec_role: Refreshing state... [id=demo_message_lambda_exec_role]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.download_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.network.aws_apigatewayv2_api.websocket_api: Refreshing state... [id=9cd29nbvb8]
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.disconnect_lambda_function: Refreshing state... [id=/aws/lambda/demo_disconnect_lambda_function]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_lambda_function]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.buckets.aws_s3_bucket_object.message_function_object: Refreshing state... [id=lambdas/demo/message.zip]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/download_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.buckets.aws_s3_bucket_object.validate_data_function_object: Refreshing state... [id=lambdas/demo/validate_data_handler.zip]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.policy.aws_iam_role.upload_file_s3_lambda_exec_role: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.policy.aws_iam_role.register_lambda_exec_role: Refreshing state... [id=demo_register_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.get_all_public_companies_lambda_exec_role: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role]
module.policy.aws_iam_role.company_lambda_exec_role: Refreshing state... [id=demo_company_lambda_exec_role]
module.policy.aws_iam_role.validate_data_lambda_exec_role: Refreshing state... [id=demo_validate_data_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.policy.aws_iam_role.connect_lambda_exec_role: Refreshing state... [id=demo_connect_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.network.aws_apigatewayv2_stage.stage: Refreshing state... [id=demo]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.upload_file_s3: Refreshing state... [id=u4or2w]
module.policy.aws_iam_role_policy.upload_file_s3_policy: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role:demo_upload_file_s3_policy]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_vpc: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143307800000002]
module.policy.aws_iam_role_policy_attachment.register_lambda_vpc: Refreshing state... [id=demo_register_lambda_exec_role-20220503143910016300000001]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_vpc: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163629032800000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_vpc: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127271200000001]
module.policy.aws_iam_role_policy_attachment.company_lambda_vpc: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000900000003]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744896400000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_vpc: Refreshing state... [id=demo_message_lambda_exec_role-20220503145603314500000002]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_vpc: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220503145603304000000001]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_logs: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163628999400000001]
module.policy.aws_iam_role_policy_attachment.connect_lambda_logs: Refreshing state... [id=demo_connect_lambda_exec_role-20220420102338091900000002]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.company_lambda_logs: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000100000002]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_logs: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143305700000001]
module.policy.aws_iam_role_policy_attachment.upload_file_s3_lambda_logs: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role-20220411202109965800000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_logs: Refreshing state... [id=demo_message_lambda_exec_role-20220420120428768600000001]
module.policy.aws_iam_role_policy_attachment.register_lambda_logs: Refreshing state... [id=demo_register_lambda_exec_role-20220427122624952100000001]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_logs: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220420102337857000000001]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_logs: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127368000000002]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744901200000002]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=xequr9]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.network.aws_api_gateway_resource.validate_data: Refreshing state... [id=pi6a5s]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.network.aws_api_gateway_resource.public_companies: Refreshing state... [id=4v8ab4]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:13]
module.functions.aws_lambda_function.connect_lambda_function: Refreshing state... [id=demo_connect_lambda_function]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.network.aws_api_gateway_resource.download_comparison_vs_peers: Refreshing state... [id=zgaw7c]
module.network.aws_api_gateway_resource.user_roles: Refreshing state... [id=npbrdw]
module.policy.aws_iam_role_policy.allow_execute_api_message_connection: Refreshing state... [id=demo_message_lambda_exec_role:demo_allow_execute_api_message_connection_policy]
module.policy.aws_iam_role_policy.allow_execute_api_register_connection: Refreshing state... [id=demo_register_lambda_exec_role:demo_allow_execute_api_register_connection_policy]
module.policy.aws_lambda_permission.websocket_connect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_disconnect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_register: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_message: Refreshing state... [id=AllowExecutionFromApiGateway]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.functions.aws_lambda_function.upload_file_s3_lambda_function: Refreshing state... [id=demo_upload_file_s3_lambda_function]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.functions.aws_lambda_function.message_lambda_function: Refreshing state... [id=demo_message_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.functions.aws_lambda_function.disconnect_lambda_function: Refreshing state... [id=demo_disconnect_lambda_function]
module.functions.aws_lambda_function.validate_data_lambda_function: Refreshing state... [id=demo_validate_data_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.register_lambda_function: Refreshing state... [id=demo_register_lambda_function]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.policy.aws_iam_role_policy.get_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role:demo_get_comparison_vs_peers_cognito_policy]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.policy.aws_iam_role_policy.change_user_role_cognito_policy: Refreshing state... [id=demo_change_user_role_lambda_exec_role:demo_change_user_role_cognito_policy]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.functions.aws_lambda_function.change_user_role_lambda_function: Refreshing state... [id=demo_change_user_role_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.get_all_public_companies_lambda_function: Refreshing state... [id=demo_get_all_public_companies_lambda_function]
module.policy.aws_iam_role_policy.assign_company_permissions_cognito_policy: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role:demo_assign_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.download_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role:demo_download_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_universe_overview_cognito_policy: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role:demo_get_universe_overview_cognito_policy]
module.policy.aws_iam_role_policy.change_company_publicly_cognito_policy: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role:demo_change_company_publicly_cognito_policy]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.policy.aws_iam_role_policy.get_company_permissions_cognito_policy: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role:demo_get_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.policy.aws_iam_role_policy.get_all_public_companies_cognito_policy: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role:demo_get_all_public_companies_cognito_policy]
module.policy.aws_iam_role_policy.get_company_report_vs_peers_cognito_policy: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role:demo_get_company_report_vs_peers_cognito_policy]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_apigatewayv2_integration.disconnect_integration: Refreshing state... [id=usm7qx9]
module.network.aws_apigatewayv2_integration.connect_integration: Refreshing state... [id=lov27i5]
module.network.aws_apigatewayv2_integration.message_integration: Refreshing state... [id=bwwsvap]
module.network.aws_apigatewayv2_integration.register_integration: Refreshing state... [id=qzrgtru]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.validate_data_method: Refreshing state... [id=agm-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.download_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.get_all_public_companies_method: Refreshing state... [id=agm-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_method.change_user_role_method: Refreshing state... [id=agm-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.upload_file_s3_method: Refreshing state... [id=agm-kb7gblbu69-u4or2w-POST]
module.network.aws_apigatewayv2_route.message_route: Refreshing state... [id=b6359n3]
module.network.aws_apigatewayv2_route.connect_route: Refreshing state... [id=lb55rfq]
module.network.aws_apigatewayv2_route.register_route: Refreshing state... [id=f5rytev]
module.network.aws_apigatewayv2_route.disconnect_route: Refreshing state... [id=i6ilvcd]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.validate_data_integration: Refreshing state... [id=agi-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_integration.download_comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.public_companies_integration: Refreshing state... [id=agi-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_integration.change_user_role_integration: Refreshing state... [id=agi-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.upload_file_s3_integration: Refreshing state... [id=agi-kb7gblbu69-u4or2w-POST]
module.network.aws_apigatewayv2_deployment.deploy: Refreshing state... [id=ey3sgf]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_upload_file_s3_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayUploadFileS3]
module.policy.aws_lambda_permission.apigw_get_all_public_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_change_user_role_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeUserRole]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_download_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_validate_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayValidateData]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be created
  + resource "aws_s3_bucket_object" "add_investment_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "34bbe5b812dfe264feab241bbb403118"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/add_investment_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/add_investment_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "45297d34eec34c02dcf2cca929733a92" -> "12709c7ea715042185bdb796ccb5c2d3"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "6e20fff46ec03e0ffd3146b143a2f606" -> "710b7ad4656c843bd323c7b62e7a6e53"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "6972e43cd8b19cb02be86c36c94fa2be" -> "e82c3d3fe1242f501734556f63e37316"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "3ef5b8886d7242e4a7eb3e63257d782b" -> "820f04766591991a68d26747cba5a531"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "e4906d2104a1ee7e5227da733627b449" -> "222e7d5957ed68f40113f785b9f78efe"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "deba7260655c36fb6678d1cead37d771" -> "4149629bd13ab683c4f8d1605d1f5a8d"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "514a9802ce1a1f3c968fbac19e9b3400" -> "a3a42b47492eeff6b3802f3b7880206f"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "9005febbf47393a69d034a9ad25b5bde" -> "6ea60e84d474f1d60fc0ba9b62141db9"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.etl_script_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "etl_script_object" {
      ~ etag               = "bc7d53bdec73ab73730d601ddff64868" -> "c6c1f0a61aa7c1b0a489bfdfb9f01aec"
        id                 = "pyspark/kpinetwork_analizer.py"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "445c3ed0a162657c6c527457ae676c03" -> "dda56e31ccd3af5821bfa217d51c63a6"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "3aeb03accbced62083a40c737006c17e" -> "78fa41830c3bd940114b06304d6ca1d5"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ etag               = "8bfdc9024672944f8d5bdc0529a8ce7f" -> "59a26d6c0e5d3866e42b27f56a23184d"
        id                 = "lambdas/demo/get_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be created
  + resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "6dbc4040279cd89b97ec6577b29f77c5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_company_investments_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_company_investments_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "3c32a048bc42a09c76293033a7b347b9" -> "01061cc85b76a3948f1a3bac8fc25e4e"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "1c65bba522387cfb9989df087203104a" -> "24d7a8929897813fb4475c4eea7a9e6e"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "e5e78c22253eec3af18a72d33ddf13d0" -> "ee47f06fce624576da95ad7fef944665"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "9c7eb4dfcc5ba5ee5d2eaae8af6e38dd" -> "1aa83fd8d8c2e4c5c141d14215f7fb9c"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "b842b1d8fa6d188cb249e6032fd0de87" -> "9ac1bc109dd8134587a46d21a162bee8"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "203374d75b4a7b9ee3e7421997468b88" -> "a8be02280a82fda4dd83ba2ff7f4af7c"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "489b5f767a96e45a59e255012b18a257" -> "02fd78a01946b427fa99ef86eec76b1d"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "eddd46dc1a728e9388da87825da929ce" -> "7bfc0032ab8c0acd28aef143ec618edc"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "85c26cb66e4cec89cb817d952dc9b17d" -> "eb6cc6f864eb8bbb14725340840c1571"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "eca7b80bb0c3550e1e2a0b02238d6e03" -> "593b49fef70c066794d2e7444fee75d3"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "4bf70a9680822b0fa73286879b116390" -> "4546ede822ed2524b15d03fe60891198"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "995e9d20cdc05af82f32b714bf96da2e" -> "a270314787bd31287f037ff465dc8fd6"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "2d13485547e8ba7f4fd87d820d066d1e" -> "58021f7e5da0dc64c74a7e3ecac34475"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "19f6911aa924596db1effdd416618554" -> "af03a84dad17a3beef48b9ffa898a00a"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be created
  + resource "aws_lambda_function" "add_investment_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_add_investment_lambda_function"
      + handler                        = "add_investment_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:13",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/add_investment_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "6+U/hgZWRUCtf8mJHaVW3cBt/TJ/asz16nnIBWR3XJo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = (sensitive)
              + "DB_NAME"     = "demokpinetworkdb"
              + "DB_PASSWORD" = (sensitive)
              + "DB_USERNAME" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "SqR+EYi0YjSgfHf2gGxa7TqKCTeNnpKhzUfu8pBA+ok=" -> "QYXLEySVh5H0q0qgDYyA02Juc5Cmhc3yAulkZMv2D7k="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "3guIQ+SBhm/4EoGl69dqRtHxKTbUxOJusFPgE2APukU=" -> "pvJGGCLU6r09ZRFt+FEav4N3ex9g3uEgh9PbdtbRNCI="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "ygHT8UerJpmL/nTcPLmHdsQga8VnsLTG8jSXbZlWH/k=" -> "LbS0/lc4mr+uREK1gwIZ+N8XfbeYQXWJLAIgj67G41c="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "76heqAk0dpnY+QADMJvyR8sT7LXm42GdevmesYSmgUI=" -> "6VkUhlsdTwUMzrqL8T+J+mx97AeD9vUB1iUxe6Fipp8="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "9KKJRzRD+crVzrl9f/b+JSOsrCyCKFZElGRvlgDC1xY=" -> "yOsOevM8A4N6Ucm4Aka/IUazKyhY54TV0TpCWKWzppc="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "06RQ/mktEC68RPwg/jBxTS93xAXsQtEtdVvpxcMzPew=" -> "9LUnbm4o62pnhcBMW5z+R1jvWdPPEGPHyfYX+uzJ6cU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "RpEdTBwFTtxn1YE8BmUxuQmxS5QlbBBdmV9gynBFRtM=" -> "6regMPMRSJJtcxEmYgE4zmrMrrKRp+2bIfq1zQk17jM="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "3TIBHeI6QIEy/zG+7S6uIlB3o3T2XRwmlOy+HzEAZag=" -> "/+RN+/2BaYrGLzMNuYHuSolD2Fx/XF2Ef1KvKNYAhNo="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "w1pEgij7a9PJIPjl9aWtExqAo+kBYhVjQ3FzHVsg1WA=" -> "61STXc/37hQ9pcXzmoOfRwZcNkoaHHQRNpa6oqWaS1c="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "C88Zl6t4s0Ob8soWREh+apIoBl7UryMzVb/U0aHvsPY=" -> "S3VcQn24r5Bx/MSqxpZHaQ8a4GpgBCrJHBpVBcddCVk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be created
  + resource "aws_lambda_function" "get_company_investments_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_company_investments_lambda_function"
      + handler                        = "get_company_investments_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:13",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_company_investments_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "nU1E5VC4B5M4OqFTcu8PdRFv1xfEYd3+ox/YFIR5IFk="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = (sensitive)
              + "DB_NAME"     = "demokpinetworkdb"
              + "DB_PASSWORD" = (sensitive)
              + "DB_USERNAME" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "rdAE0wADvcQhT0BIJiABaUnEtGJ6kyQ1/8A+qRSFVQE=" -> "/pO1MXr+hZzzbH7ZHDfNAn7K/CJxw5z8ygK1vLxNUWg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "F/FtUsEg+KfiF5aC8oPXjjrpthIqN42MS6lKGZo/0eo=" -> "eIIpV6IDSYU2GW0jrQ58CW/18O5i1IhuOCx9GiKOy9A="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "KpquqnPtrb86HCM+l8t5poEYMigIDpI1AUJYtXmTqwI=" -> "wAd7okN3tEBD15mPQGA5owul4mMjiN4vt5i29szuVVY="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "nrjDDEMIBusfZpkuS9rmkh4cq3VdT1rOIUXqfk16VQ8=" -> "4UgwkEVU3odoh3zMpjSiHrX+7xKmfTeSb72pqHhBwEk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "/Gz7toiw6ALhQlgFmpn8941U4nmcre2mX8rUx+/u91I=" -> "FQiBkAqOj9Om/BDyHzWbUiytzbEp/yZk6NGeS213XmI="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "dx4OKxEG3aNLUfNV+GZR0Aj0XroWWaVA4sYL+yzI24w=" -> "AThzTaD6/K1SljWsda2wETu8qqlbZO6jHmmG2I2Ub5U="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "WImn76WnCCW8x6vaIGJmldJW8X5n9UHc9bdMMUKD3oA=" -> "D7fPHiGBGCpKXVNRY0JHoJKOO438AJLVX+niGii2TyQ="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "uN1vxe17cLKk64qUu1OGXKiUTW9iY5eGaDiIOC2XK28=" -> "SzlqXierglQ0O5dRUqK+NA67u418PitQRXNehXp92u8="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "yORTKR/gOYdh7ClEYeGZJQTDy28lP1JMjedpKB8wlp4=" -> "WrVE+6EJejCEJcrRBekN5FNKgU7uN2fnIfne3ujmI+U="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gLKsn+EApJRk3cu51BgJF3Xl8ystf8iqsNioyKvKQQ0=" -> "tMaZpxMmqYAzXNfhjRx37s9tnX29ylMMRB+HcNSnHys="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ke4u5bL0WxwrtVhMR/mM65aBqI8cnS8ksaxmLOixsJg=" -> "qdGCBfscaTbAbwRAxdD6UdHO8QH/iGfVlMI1ve31fXg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "TEK+om+tFeHqnyOzDdYu21EMCAywEG1wWDvVICoMP3I=" -> "zj0ZaTcd5+/fHK6k7YfT3gAyXcw7rPSB1lVHvsWJnHQ="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "kPXctUS4IAP/+AXM/ViFZZDZHQzaNGFFih+DGlssWEE=" -> "ec2A3E0DfGcgdWQs3UPlxVkfgyXSlEmRldg7RCqRp2s="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-05-13T20:26:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "jaBvmyVtim1IPivsokZguUA78QlwjtEk8IDYF57mxtM=" -> "8kA65Rhuzv1dik0t0momOQt829TFHMW+Y5l/Fmd6GRk="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-05-13T20:26:24Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xequr9" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-05-13T20:26:23Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.add_investment_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "add_investment_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_add_investment_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_company_investments_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_company_investments_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_company_investments_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.add_investment_integration will be created
  + resource "aws_api_gateway_integration" "add_investment_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.company_investments_integration will be created
  + resource "aws_api_gateway_integration" "company_investments_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.add_investment_method will be created
  + resource "aws_api_gateway_method" "add_investment_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.get_company_investments_method will be created
  + resource "aws_api_gateway_method" "get_company_investments_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.company_investments will be created
  + resource "aws_api_gateway_resource" "company_investments" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{company_id}"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.investments will be created
  + resource "aws_api_gateway_resource" "investments" {
      + id          = (known after apply)
      + parent_id   = "0ay34r2gi9"
      + path        = (known after apply)
      + path_part   = "investments"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-05-13T20:26:23Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.add_investment_lambda_exec_role will be created
  + resource "aws_iam_role" "add_investment_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_add_investment_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role.company_investments_lambda_exec_role will be created
  + resource "aws_iam_role" "company_investments_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_company_investments_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy_attachment.add_investment_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "add_investment_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_add_investment_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.add_investment_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "add_investment_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_add_investment_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.company_investments_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "company_investments_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_company_investments_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.company_investments_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "company_investments_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_company_investments_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_add_investment_lambda will be created
  + resource "aws_lambda_permission" "apigw_add_investment_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_add_investment_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayAddInvestmentId"
    }

  # module.policy.aws_lambda_permission.apigw_company_investments_lambda will be created
  + resource "aws_lambda_permission" "apigw_company_investments_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_company_investments_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayGetCompanyInvestmentsId"
    }

Plan: 21 to add, 52 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*